app/views/problems/show.html.erb

SELECT "solutions".* FROM "solutions"  WHERE "solutions"."problem_id" = ?  [["problem_id", 1]]
---

<% @problem.solutions.each do |solution| %>

SELECT COUNT(*) FROM "votes"  WHERE "votes"."solution_id" = ?  [["solution_id", 1]]
---
  <%= solution.text %>
  <%= pluralize(solution.votes.count, "vote") %>