app/controllers/problems_controller.rb

  def index
    @problem = Problem.all
---
SELECT "problems".* FROM "problems"

  def create
    @problem = Problem.new(problem_params)

    if @problem.save
---
INSERT INTO "problems" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-11-02 10:40:45.432501"], ["text", "this is a new problem i am posting "], ["title", "This is a problem"], ["updated_at", "2014-11-02 10:40:45.432501"]]

  def list
    @problem = Problem.all
---
SELECT "problems".* FROM "problems"

  def show
    @problem = Problem.find(params[:id])
---
SELECT  "problems".* FROM "problems"  WHERE "problems"."id" = ? LIMIT 1  [["id", 5]]

  def edit
    @problem = Problem.find(params[:id])
---
SELECT  "problems".* FROM "problems"  WHERE "problems"."id" = ? LIMIT 1  [["id", 5]]

  def destroy
    @problem = Problem.find(params[:id])
    @problem.destroy
---
SELECT  "problems".* FROM "problems"  WHERE "problems"."id" = ? LIMIT 1  [["id", 14]]
DELETE FROM "problems" WHERE "problems"."id" = ?  [["id", 14]]