app/controllers/solutions_controller.rb

SELECT  "problems".* FROM "problems"  WHERE "problems"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "solutions" ("created_at", "problem_id", "text", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-11-02 17:52:12.744893"], ["problem_id", 1], ["text", "cccdddd"], ["updated_at", "2014-11-02 17:52:12.744893"]]
---
  def create
    @problem = Problem.find(params[:problem_id])
    @solution = @problem.solutions.create(solution_params)

INSERT INTO "votes" ("created_at", "solution_id", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-11-03 00:58:30.825463"], ["solution_id", 1], ["updated_at", "2014-11-03 00:58:30.825463"]]
---
  def upvote
    @solution = Soluton.find(params[:id])
    @solution.votes.create